nxp-mcuxpresso/mcux-sdk/devices/KW45B41Z82/KW45B41Z82.h
#define RFMC_XO_CTRL_XTAL_RDY_OVR_EN_MASK        (0x400000U)
#define RFMC_XO_CTRL_XTAL_RDY_OVR_EN_SHIFT       (22U)
/*! XTAL_RDY_OVR_EN - XTAL Ready Override Enable */
#define RFMC_XO_CTRL_XTAL_RDY_OVR_EN(x)          (((uint32_t)(((uint32_t)(x)) << RFMC_XO_CTRL_XTAL_RDY_OVR_EN_SHIFT)) & RFMC_XO_CTRL_XTAL_RDY_OVR_EN_MASK)

#define RFMC_XO_CTRL_XTAL_RDY_OVR_MASK           (0x800000U)
#define RFMC_XO_CTRL_XTAL_RDY_OVR_SHIFT          (23U)
/*! XTAL_RDY_OVR - XTAL Ready Override */
#define RFMC_XO_CTRL_XTAL_RDY_OVR(x)             (((uint32_t)(((uint32_t)(x)) << RFMC_XO_CTRL_XTAL_RDY_OVR_SHIFT)) & RFMC_XO_CTRL_XTAL_RDY_OVR_MASK)

#define RFMC_XO_CTRL_SPARE_MASK                  (0xF000000U)
#define RFMC_XO_CTRL_SPARE_SHIFT                 (24U)
/*! SPARE - XO Spare Registers */
#define RFMC_XO_CTRL_SPARE(x)                    (((uint32_t)(((uint32_t)(x)) << RFMC_XO_CTRL_SPARE_SHIFT)) & RFMC_XO_CTRL_SPARE_MASK)

#define RFMC_XO_CTRL_XO_LDO_OVR_MASK             (0x10000000U)
#define RFMC_XO_CTRL_XO_LDO_OVR_SHIFT            (28U)
/*! XO_LDO_OVR - XO LDO Enable Override
 *  0b0..XO LDO enable not overridden
 *  0b1..XO LDO enable overridden by XO_LDO_EN bit
 */
#define RFMC_XO_CTRL_XO_LDO_OVR(x)               (((uint32_t)(((uint32_t)(x)) << RFMC_XO_CTRL_XO_LDO_OVR_SHIFT)) & RFMC_XO_CTRL_XO_LDO_OVR_MASK)

#define RFMC_XO_CTRL_XO_LDO_EN_MASK              (0x20000000U)
#define RFMC_XO_CTRL_XO_LDO_EN_SHIFT             (29U)
/*! XO_LDO_EN - XO LDO Enable
 *  0b0..XO LDO disabled
 *  0b1..XO LDO enabled
 */
#define RFMC_XO_CTRL_XO_LDO_EN(x)                (((uint32_t)(((uint32_t)(x)) << RFMC_XO_CTRL_XO_LDO_EN_SHIFT)) & RFMC_XO_CTRL_XO_LDO_EN_MASK)

#define RFMC_XO_CTRL_XO_ANA_OVR_MASK             (0x40000000U)
#define RFMC_XO_CTRL_XO_ANA_OVR_SHIFT            (30U)
/*! XO_ANA_OVR - XO Analog Enable Override
 *  0b0..XO analog enable not overridden
 *  0b1..XO analog enable overridden by XO_ANA_EN bit
 */
#define RFMC_XO_CTRL_XO_ANA_OVR(x)               (((uint32_t)(((uint32_t)(x)) << RFMC_XO_CTRL_XO_ANA_OVR_SHIFT)) & RFMC_XO_CTRL_XO_ANA_OVR_MASK)

#define RFMC_XO_CTRL_XO_ANA_EN_MASK              (0x80000000U)
#define RFMC_XO_CTRL_XO_ANA_EN_SHIFT             (31U)
/*! XO_ANA_EN - XO Analog Enable
 *  0b0..XO analog disabled
 *  0b1..XO analog enabled
 */
#define RFMC_XO_CTRL_XO_ANA_EN(x)                (((uint32_t)(((uint32_t)(x)) << RFMC_XO_CTRL_XO_ANA_EN_SHIFT)) & RFMC_XO_CTRL_XO_ANA_EN_MASK)
/*! @} */

/*! @name XO_STAT - XO Status Register */
/*! @{ */

#define RFMC_XO_STAT_RDY_FLAG_MASK               (0x1U)
#define RFMC_XO_STAT_RDY_FLAG_SHIFT              (0U)
/*! RDY_FLAG - XTAL Ready Flag */
#define RFMC_XO_STAT_RDY_FLAG(x)                 (((uint32_t)(((uint32_t)(x)) << RFMC_XO_STAT_RDY_FLAG_SHIFT)) & RFMC_XO_STAT_RDY_FLAG_MASK)

#define RFMC_XO_STAT_INT_FLAG_MASK               (0x2U)
#define RFMC_XO_STAT_INT_FLAG_SHIFT              (1U)
/*! INT_FLAG - XO Internal Request Flag */
#define RFMC_XO_STAT_INT_FLAG(x)                 (((uint32_t)(((uint32_t)(x)) << RFMC_XO_STAT_INT_FLAG_SHIFT)) & RFMC_XO_STAT_INT_FLAG_MASK)

#define RFMC_XO_STAT_EXT_FLAG_MASK               (0x4U)
#define RFMC_XO_STAT_EXT_FLAG_SHIFT              (2U)
/*! EXT_FLAG - XO External Request Flag */
#define RFMC_XO_STAT_EXT_FLAG(x)                 (((uint32_t)(((uint32_t)(x)) << RFMC_XO_STAT_EXT_FLAG_SHIFT)) & RFMC_XO_STAT_EXT_FLAG_MASK)

#define RFMC_XO_STAT_XTAL_RDY_MASK               (0x10U)
#define RFMC_XO_STAT_XTAL_RDY_SHIFT              (4U)
/*! XTAL_RDY - XTAL Ready */
#define RFMC_XO_STAT_XTAL_RDY(x)                 (((uint32_t)(((uint32_t)(x)) << RFMC_XO_STAT_XTAL_RDY_SHIFT)) & RFMC_XO_STAT_XTAL_RDY_MASK)

#define RFMC_XO_STAT_XO_EN_MASK                  (0x20U)
#define RFMC_XO_STAT_XO_EN_SHIFT                 (5U)
/*! XO_EN - XO_EN */
#define RFMC_XO_STAT_XO_EN(x)                    (((uint32_t)(((uint32_t)(x)) << RFMC_XO_STAT_XO_EN_SHIFT)) & RFMC_XO_STAT_XO_EN_MASK)
/*! @} */

/*! @name XO_TEST - XO Test Register */
/*! @{ */

#define RFMC_XO_TEST_ISEL_MASK                   (0xFU)
#define RFMC_XO_TEST_ISEL_SHIFT                  (0U)
/*! ISEL - XO Amplifier Current Select
 *  0b0000..40uA (min)
 *  0b0001..80uA
 *  0b0101..240uA (default)
 *  0b1111..640uA (max)
 */
#define RFMC_XO_TEST_ISEL(x)                     (((uint32_t)(((uint32_t)(x)) << RFMC_XO_TEST_ISEL_SHIFT)) & RFMC_XO_TEST_ISEL_MASK)

#define RFMC_XO_TEST_CDAC_MASK                   (0x3F0U)
#define RFMC_XO_TEST_CDAC_SHIFT                  (4U)
/*! CDAC - XO On-chip Load Capacitor Trim
 *  0b000000..6pF
 *  0b111111..11pF
 */
#define RFMC_XO_TEST_CDAC(x)                     (((uint32_t)(((uint32_t)(x)) << RFMC_XO_TEST_CDAC_SHIFT)) & RFMC_XO_TEST_CDAC_MASK)

#define RFMC_XO_TEST_CAP_OFF_MASK                (0x400U)
#define RFMC_XO_TEST_CAP_OFF_SHIFT               (10U)
/*! CAP_OFF - XO Load Capacitor Disable */
#define RFMC_XO_TEST_CAP_OFF(x)                  (((uint32_t)(((uint32_t)(x)) << RFMC_XO_TEST_CAP_OFF_SHIFT)) & RFMC_XO_TEST_CAP_OFF_MASK)

#define RFMC_XO_TEST_AUX_PD_MASK                 (0x800U)
#define RFMC_XO_TEST_AUX_PD_SHIFT                (11U)
/*! AUX_PD - XO CLK_AUX_DRV Powerdown */
#define RFMC_XO_TEST_AUX_PD(x)                   (((uint32_t)(((uint32_t)(x)) << RFMC_XO_TEST_AUX_PD_SHIFT)) & RFMC_XO_TEST_AUX_PD_MASK)

#define RFMC_XO_TEST_AMP_FORCE_MASK              (0x1000U)
#define RFMC_XO_TEST_AMP_FORCE_SHIFT             (12U)
/*! AMP_FORCE - XO Amplifier Force PTAT Startup */
#define RFMC_XO_TEST_AMP_FORCE(x)                (((uint32_t)(((uint32_t)(x)) << RFMC_XO_TEST_AMP_FORCE_SHIFT)) & RFMC_XO_TEST_AMP_FORCE_MASK)

#define RFMC_XO_TEST_DYN_ISEL_MASK               (0x2000U)
#define RFMC_XO_TEST_DYN_ISEL_SHIFT              (13U)
/*! DYN_ISEL - XO Amplifier: enable current switching during startup */
#define RFMC_XO_TEST_DYN_ISEL(x)                 (((uint32_t)(((uint32_t)(x)) << RFMC_XO_TEST_DYN_ISEL_SHIFT)) & RFMC_XO_TEST_DYN_ISEL_MASK)

#define RFMC_XO_TEST_DYN_CAP_MASK                (0x4000U)
#define RFMC_XO_TEST_DYN_CAP_SHIFT               (14U)
/*! DYN_CAP - XO On-chip Load Capacitor: enable switching during startup */
#define RFMC_XO_TEST_DYN_CAP(x)                  (((uint32_t)(((uint32_t)(x)) << RFMC_XO_TEST_DYN_CAP_SHIFT)) & RFMC_XO_TEST_DYN_CAP_MASK)

#define RFMC_XO_TEST_LDO_TRIM_MASK               (0x30000U)
#define RFMC_XO_TEST_LDO_TRIM_SHIFT              (16U)
/*! LDO_TRIM - XO LDO Output Voltage Trim
 *  0b00..0.92V
 *  0b01..0.885V
 *  0b10..0.955V
 *  0b11..1.011V
 */
#define RFMC_XO_TEST_LDO_TRIM(x)                 (((uint32_t)(((uint32_t)(x)) << RFMC_XO_TEST_LDO_TRIM_SHIFT)) & RFMC_XO_TEST_LDO_TRIM_MASK)

#define RFMC_XO_TEST_LDO_BUMP_MASK               (0xC0000U)
#define RFMC_XO_TEST_LDO_BUMP_SHIFT              (18U)
/*! LDO_BUMP - XO LDO PTAT Current Bump
 *  0b00..PTAT current bump default
 *  0b01..PTAT current boost: +30%
 */
#define RFMC_XO_TEST_LDO_BUMP(x)                 (((uint32_t)(((uint32_t)(x)) << RFMC_XO_TEST_LDO_BUMP_SHIFT)) & RFMC_XO_TEST_LDO_BUMP_MASK)

#define RFMC_XO_TEST_LDO_FORCE_MASK              (0x100000U)
#define RFMC_XO_TEST_LDO_FORCE_SHIFT             (20U)
/*! LDO_FORCE - XO LDO Force PTAT Startup */
#define RFMC_XO_TEST_LDO_FORCE(x)                (((uint32_t)(((uint32_t)(x)) << RFMC_XO_TEST_LDO_FORCE_SHIFT)) & RFMC_XO_TEST_LDO_FORCE_MASK)
/*! @} */

/*! @name RF2P4GHZ_CTRL - 2.4GHz Radio Control Register */
/*! @{ */

#define RFMC_RF2P4GHZ_CTRL_WOR_WKUP_IE_MASK      (0x1U)
#define RFMC_RF2P4GHZ_CTRL_WOR_WKUP_IE_SHIFT     (0U)
/*! WOR_WKUP_IE - WOR Wakeup Interrupt Enable
 *  0b0..WOR wakeup interrupt disabled
 *  0b1..WOR wakeup interrupt enabled
 */
#define RFMC_RF2P4GHZ_CTRL_WOR_WKUP_IE(x)        (((uint32_t)(((uint32_t)(x)) << RFMC_RF2P4GHZ_CTRL_WOR_WKUP_IE_SHIFT)) & RFMC_RF2P4GHZ_CTRL_WOR_WKUP_IE_MASK)

#define RFMC_RF2P4GHZ_CTRL_MAN_WKUP_IE_MASK      (0x2U)
#define RFMC_RF2P4GHZ_CTRL_MAN_WKUP_IE_SHIFT     (1U)
/*! MAN_WKUP_IE - MAN Wakeup Interrupt Enable
 *  0b0..MAN wakeup interrupt disabled
 *  0b1..MAN wakeup interrupt enabled
 */
#define RFMC_RF2P4GHZ_CTRL_MAN_WKUP_IE(x)        (((uint32_t)(((uint32_t)(x)) << RFMC_RF2P4GHZ_CTRL_MAN_WKUP_IE_SHIFT)) & RFMC_RF2P4GHZ_CTRL_MAN_WKUP_IE_MASK)

