nxp-mcuxpresso/mcux-sdk/devices/KW45B41Z82/KW45B41Z82.h
#define XCVR_MISC_LCL_TX_CFG1_TX_HI_PER_1_MASK   (0xF8000000U)
#define XCVR_MISC_LCL_TX_CFG1_TX_HI_PER_1_SHIFT  (27U)
/*! TX_HI_PER_1 - Alternate Number of intervals for antenna HIGH. Used only in conjunction with RSM. */
#define XCVR_MISC_LCL_TX_CFG1_TX_HI_PER_1(x)     (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_LCL_TX_CFG1_TX_HI_PER_1_SHIFT)) & XCVR_MISC_LCL_TX_CFG1_TX_HI_PER_1_MASK)
/*! @} */

/*! @name LCL_TX_CFG2 - LCL CTRL TX CONFIG2 */
/*! @{ */

#define XCVR_MISC_LCL_TX_CFG2_TX_LO_PER_2_MASK   (0x1F000U)
#define XCVR_MISC_LCL_TX_CFG2_TX_LO_PER_2_SHIFT  (12U)
/*! TX_LO_PER_2 - Alternate Number of intervals for antenna LOW. Used only in conjunction with RSM. */
#define XCVR_MISC_LCL_TX_CFG2_TX_LO_PER_2(x)     (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_LCL_TX_CFG2_TX_LO_PER_2_SHIFT)) & XCVR_MISC_LCL_TX_CFG2_TX_LO_PER_2_MASK)

#define XCVR_MISC_LCL_TX_CFG2_TX_HI_PER_2_MASK   (0x3E0000U)
#define XCVR_MISC_LCL_TX_CFG2_TX_HI_PER_2_SHIFT  (17U)
/*! TX_HI_PER_2 - Alternate Number of intervals for antenna HIGH. Used only in conjunction with RSM. */
#define XCVR_MISC_LCL_TX_CFG2_TX_HI_PER_2(x)     (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_LCL_TX_CFG2_TX_HI_PER_2_SHIFT)) & XCVR_MISC_LCL_TX_CFG2_TX_HI_PER_2_MASK)

#define XCVR_MISC_LCL_TX_CFG2_TX_LO_PER_3_MASK   (0x7C00000U)
#define XCVR_MISC_LCL_TX_CFG2_TX_LO_PER_3_SHIFT  (22U)
/*! TX_LO_PER_3 - Alternate Number of intervals for antenna LOW. Used only in conjunction with RSM. */
#define XCVR_MISC_LCL_TX_CFG2_TX_LO_PER_3(x)     (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_LCL_TX_CFG2_TX_LO_PER_3_SHIFT)) & XCVR_MISC_LCL_TX_CFG2_TX_LO_PER_3_MASK)

#define XCVR_MISC_LCL_TX_CFG2_TX_HI_PER_3_MASK   (0xF8000000U)
#define XCVR_MISC_LCL_TX_CFG2_TX_HI_PER_3_SHIFT  (27U)
/*! TX_HI_PER_3 - Alternate Number of intervals for antenna HIGH. Used only in conjunction with RSM. */
#define XCVR_MISC_LCL_TX_CFG2_TX_HI_PER_3(x)     (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_LCL_TX_CFG2_TX_HI_PER_3_SHIFT)) & XCVR_MISC_LCL_TX_CFG2_TX_HI_PER_3_MASK)
/*! @} */

/*! @name LCL_RX_CFG0 - LCL CTRL RX CONFIG0 */
/*! @{ */

#define XCVR_MISC_LCL_RX_CFG0_RX_DELAY_MASK      (0x7FFU)
#define XCVR_MISC_LCL_RX_CFG0_RX_DELAY_SHIFT     (0U)
/*! RX_DELAY - Interval delay before RX switching begins. */
#define XCVR_MISC_LCL_RX_CFG0_RX_DELAY(x)        (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_LCL_RX_CFG0_RX_DELAY_SHIFT)) & XCVR_MISC_LCL_RX_CFG0_RX_DELAY_MASK)

#define XCVR_MISC_LCL_RX_CFG0_RX_DELAY_OFF_MASK  (0x1F0000U)
#define XCVR_MISC_LCL_RX_CFG0_RX_DELAY_OFF_SHIFT (16U)
/*! RX_DELAY_OFF - Fine sample delay after RX_DELAY. */
#define XCVR_MISC_LCL_RX_CFG0_RX_DELAY_OFF(x)    (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_LCL_RX_CFG0_RX_DELAY_OFF_SHIFT)) & XCVR_MISC_LCL_RX_CFG0_RX_DELAY_OFF_MASK)
/*! @} */

/*! @name LCL_RX_CFG1 - LCL CTRL RX CONFIG1 */
/*! @{ */

#define XCVR_MISC_LCL_RX_CFG1_RX_SPINT_MASK      (0x1FU)
#define XCVR_MISC_LCL_RX_CFG1_RX_SPINT_SHIFT     (0U)
/*! RX_SPINT - Number of RX Samples that define the length of an Interval, where 0=1sample, 1=2sample, etc. */
#define XCVR_MISC_LCL_RX_CFG1_RX_SPINT(x)        (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_LCL_RX_CFG1_RX_SPINT_SHIFT)) & XCVR_MISC_LCL_RX_CFG1_RX_SPINT_MASK)

#define XCVR_MISC_LCL_RX_CFG1_RX_ANT_TRIG_SEL_MASK (0xE0U)
#define XCVR_MISC_LCL_RX_CFG1_RX_ANT_TRIG_SEL_SHIFT (5U)
/*! RX_ANT_TRIG_SEL - Selects Trigger for RX
 *  0b000..Software Trigger
 *  0b001..LCL Pattern Found
 *  0b010..CRC Complete
 *  0b011..CRC Pass
 *  0b100..GenericLL: cte_present, Bluetooth LE: cte_en
 *  0b101..aa_fnd_to_ll
 *  0b110..Ranging sequence manager lcl_rx_trigger
 */
#define XCVR_MISC_LCL_RX_CFG1_RX_ANT_TRIG_SEL(x) (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_LCL_RX_CFG1_RX_ANT_TRIG_SEL_SHIFT)) & XCVR_MISC_LCL_RX_CFG1_RX_ANT_TRIG_SEL_MASK)

#define XCVR_MISC_LCL_RX_CFG1_RX_LO_PER_MASK     (0x1F000U)
#define XCVR_MISC_LCL_RX_CFG1_RX_LO_PER_SHIFT    (12U)
/*! RX_LO_PER - Primary Number of intervals for antenna LOW */
#define XCVR_MISC_LCL_RX_CFG1_RX_LO_PER(x)       (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_LCL_RX_CFG1_RX_LO_PER_SHIFT)) & XCVR_MISC_LCL_RX_CFG1_RX_LO_PER_MASK)

#define XCVR_MISC_LCL_RX_CFG1_RX_HI_PER_MASK     (0x3E0000U)
#define XCVR_MISC_LCL_RX_CFG1_RX_HI_PER_SHIFT    (17U)
/*! RX_HI_PER - Primary Number of intervals for antenna HIGH */
#define XCVR_MISC_LCL_RX_CFG1_RX_HI_PER(x)       (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_LCL_RX_CFG1_RX_HI_PER_SHIFT)) & XCVR_MISC_LCL_RX_CFG1_RX_HI_PER_MASK)

#define XCVR_MISC_LCL_RX_CFG1_RX_LO_PER_1_MASK   (0x7C00000U)
#define XCVR_MISC_LCL_RX_CFG1_RX_LO_PER_1_SHIFT  (22U)
/*! RX_LO_PER_1 - Alternate Number of intervals for antenna LOW. Used only in conjunction with RSM. */
#define XCVR_MISC_LCL_RX_CFG1_RX_LO_PER_1(x)     (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_LCL_RX_CFG1_RX_LO_PER_1_SHIFT)) & XCVR_MISC_LCL_RX_CFG1_RX_LO_PER_1_MASK)

#define XCVR_MISC_LCL_RX_CFG1_RX_HI_PER_1_MASK   (0xF8000000U)
#define XCVR_MISC_LCL_RX_CFG1_RX_HI_PER_1_SHIFT  (27U)
/*! RX_HI_PER_1 - Alternate Number of intervals for antenna HIGH. Used only in conjunction with RSM. */
#define XCVR_MISC_LCL_RX_CFG1_RX_HI_PER_1(x)     (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_LCL_RX_CFG1_RX_HI_PER_1_SHIFT)) & XCVR_MISC_LCL_RX_CFG1_RX_HI_PER_1_MASK)
/*! @} */

/*! @name LCL_RX_CFG2 - LCL CTRL RX CONFIG2 */
/*! @{ */

#define XCVR_MISC_LCL_RX_CFG2_RX_LO_PER_2_MASK   (0x1F000U)
#define XCVR_MISC_LCL_RX_CFG2_RX_LO_PER_2_SHIFT  (12U)
/*! RX_LO_PER_2 - Alternate Number of intervals for antenna LOW. Used only in conjunction with RSM. */
#define XCVR_MISC_LCL_RX_CFG2_RX_LO_PER_2(x)     (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_LCL_RX_CFG2_RX_LO_PER_2_SHIFT)) & XCVR_MISC_LCL_RX_CFG2_RX_LO_PER_2_MASK)

#define XCVR_MISC_LCL_RX_CFG2_RX_HI_PER_2_MASK   (0x3E0000U)
#define XCVR_MISC_LCL_RX_CFG2_RX_HI_PER_2_SHIFT  (17U)
/*! RX_HI_PER_2 - Alternate Number of intervals for antenna HIGH. Used only in conjunction with RSM. */
#define XCVR_MISC_LCL_RX_CFG2_RX_HI_PER_2(x)     (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_LCL_RX_CFG2_RX_HI_PER_2_SHIFT)) & XCVR_MISC_LCL_RX_CFG2_RX_HI_PER_2_MASK)

#define XCVR_MISC_LCL_RX_CFG2_RX_LO_PER_3_MASK   (0x7C00000U)
#define XCVR_MISC_LCL_RX_CFG2_RX_LO_PER_3_SHIFT  (22U)
/*! RX_LO_PER_3 - Alternate Number of intervals for antenna LOW. Used only in conjunction with RSM. */
#define XCVR_MISC_LCL_RX_CFG2_RX_LO_PER_3(x)     (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_LCL_RX_CFG2_RX_LO_PER_3_SHIFT)) & XCVR_MISC_LCL_RX_CFG2_RX_LO_PER_3_MASK)

#define XCVR_MISC_LCL_RX_CFG2_RX_HI_PER_3_MASK   (0xF8000000U)
#define XCVR_MISC_LCL_RX_CFG2_RX_HI_PER_3_SHIFT  (27U)
/*! RX_HI_PER_3 - Alternate Number of intervals for antenna HIGH. Used only in conjunction with RSM. */
#define XCVR_MISC_LCL_RX_CFG2_RX_HI_PER_3(x)     (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_LCL_RX_CFG2_RX_HI_PER_3_SHIFT)) & XCVR_MISC_LCL_RX_CFG2_RX_HI_PER_3_MASK)
/*! @} */

