nxp-mcuxpresso/mcux-sdk/devices/KW45B41Z82/KW45B41Z82.h
#define XCVR_RX_DIG_ACQ_FILT_0_3_H0_MASK         (0x3FU)
#define XCVR_RX_DIG_ACQ_FILT_0_3_H0_SHIFT        (0U)
/*! H0 - Acquisition Filter Coefficient 0 */
#define XCVR_RX_DIG_ACQ_FILT_0_3_H0(x)           (((uint32_t)(((uint32_t)(x)) << XCVR_RX_DIG_ACQ_FILT_0_3_H0_SHIFT)) & XCVR_RX_DIG_ACQ_FILT_0_3_H0_MASK)

#define XCVR_RX_DIG_ACQ_FILT_0_3_H1_MASK         (0x3F00U)
#define XCVR_RX_DIG_ACQ_FILT_0_3_H1_SHIFT        (8U)
/*! H1 - Acquisition Filter Coefficient 1 */
#define XCVR_RX_DIG_ACQ_FILT_0_3_H1(x)           (((uint32_t)(((uint32_t)(x)) << XCVR_RX_DIG_ACQ_FILT_0_3_H1_SHIFT)) & XCVR_RX_DIG_ACQ_FILT_0_3_H1_MASK)

#define XCVR_RX_DIG_ACQ_FILT_0_3_H2_MASK         (0x7F0000U)
#define XCVR_RX_DIG_ACQ_FILT_0_3_H2_SHIFT        (16U)
/*! H2 - Acquisition Filter Coefficient 2 */
#define XCVR_RX_DIG_ACQ_FILT_0_3_H2(x)           (((uint32_t)(((uint32_t)(x)) << XCVR_RX_DIG_ACQ_FILT_0_3_H2_SHIFT)) & XCVR_RX_DIG_ACQ_FILT_0_3_H2_MASK)

#define XCVR_RX_DIG_ACQ_FILT_0_3_H3_MASK         (0x7F000000U)
#define XCVR_RX_DIG_ACQ_FILT_0_3_H3_SHIFT        (24U)
/*! H3 - Acquisition Filter Coefficient 3 */
#define XCVR_RX_DIG_ACQ_FILT_0_3_H3(x)           (((uint32_t)(((uint32_t)(x)) << XCVR_RX_DIG_ACQ_FILT_0_3_H3_SHIFT)) & XCVR_RX_DIG_ACQ_FILT_0_3_H3_MASK)
/*! @} */

/*! @name ACQ_FILT_4_7 - Acquisition Filter Coeffs 4~7 */
/*! @{ */

#define XCVR_RX_DIG_ACQ_FILT_4_7_H4_MASK         (0x7FU)
#define XCVR_RX_DIG_ACQ_FILT_4_7_H4_SHIFT        (0U)
/*! H4 - Acquisition Filter Coefficient 4 */
#define XCVR_RX_DIG_ACQ_FILT_4_7_H4(x)           (((uint32_t)(((uint32_t)(x)) << XCVR_RX_DIG_ACQ_FILT_4_7_H4_SHIFT)) & XCVR_RX_DIG_ACQ_FILT_4_7_H4_MASK)

#define XCVR_RX_DIG_ACQ_FILT_4_7_H5_MASK         (0x7F00U)
#define XCVR_RX_DIG_ACQ_FILT_4_7_H5_SHIFT        (8U)
/*! H5 - Acquisition Filter Coefficient 5 */
#define XCVR_RX_DIG_ACQ_FILT_4_7_H5(x)           (((uint32_t)(((uint32_t)(x)) << XCVR_RX_DIG_ACQ_FILT_4_7_H5_SHIFT)) & XCVR_RX_DIG_ACQ_FILT_4_7_H5_MASK)

#define XCVR_RX_DIG_ACQ_FILT_4_7_H6_MASK         (0xFF0000U)
#define XCVR_RX_DIG_ACQ_FILT_4_7_H6_SHIFT        (16U)
/*! H6 - Acquisition Filter Coefficient 6 */
#define XCVR_RX_DIG_ACQ_FILT_4_7_H6(x)           (((uint32_t)(((uint32_t)(x)) << XCVR_RX_DIG_ACQ_FILT_4_7_H6_SHIFT)) & XCVR_RX_DIG_ACQ_FILT_4_7_H6_MASK)

#define XCVR_RX_DIG_ACQ_FILT_4_7_H7_MASK         (0xFF000000U)
#define XCVR_RX_DIG_ACQ_FILT_4_7_H7_SHIFT        (24U)
/*! H7 - Acquisition Filter Coefficient 7 */
#define XCVR_RX_DIG_ACQ_FILT_4_7_H7(x)           (((uint32_t)(((uint32_t)(x)) << XCVR_RX_DIG_ACQ_FILT_4_7_H7_SHIFT)) & XCVR_RX_DIG_ACQ_FILT_4_7_H7_MASK)
/*! @} */

/*! @name ACQ_FILT_8_9 - Acquisition Filter Coeffs 8~9 */
/*! @{ */

#define XCVR_RX_DIG_ACQ_FILT_8_9_H8_MASK         (0x1FFU)
#define XCVR_RX_DIG_ACQ_FILT_8_9_H8_SHIFT        (0U)
/*! H8 - Acquisition Filter Coefficient 8 */
#define XCVR_RX_DIG_ACQ_FILT_8_9_H8(x)           (((uint32_t)(((uint32_t)(x)) << XCVR_RX_DIG_ACQ_FILT_8_9_H8_SHIFT)) & XCVR_RX_DIG_ACQ_FILT_8_9_H8_MASK)

#define XCVR_RX_DIG_ACQ_FILT_8_9_H9_MASK         (0x1FF0000U)
#define XCVR_RX_DIG_ACQ_FILT_8_9_H9_SHIFT        (16U)
/*! H9 - Acquisition Filter Coefficient 9 */
#define XCVR_RX_DIG_ACQ_FILT_8_9_H9(x)           (((uint32_t)(((uint32_t)(x)) << XCVR_RX_DIG_ACQ_FILT_8_9_H9_SHIFT)) & XCVR_RX_DIG_ACQ_FILT_8_9_H9_MASK)
/*! @} */

/*! @name ACQ_FILT_10_11 - Acquisition Filter Coeffs 10~11 */
/*! @{ */

#define XCVR_RX_DIG_ACQ_FILT_10_11_H10_MASK      (0x3FFU)
#define XCVR_RX_DIG_ACQ_FILT_10_11_H10_SHIFT     (0U)
/*! H10 - Acquisition Filter Coefficient 10 */
#define XCVR_RX_DIG_ACQ_FILT_10_11_H10(x)        (((uint32_t)(((uint32_t)(x)) << XCVR_RX_DIG_ACQ_FILT_10_11_H10_SHIFT)) & XCVR_RX_DIG_ACQ_FILT_10_11_H10_MASK)

#define XCVR_RX_DIG_ACQ_FILT_10_11_H11_MASK      (0x3FF0000U)
#define XCVR_RX_DIG_ACQ_FILT_10_11_H11_SHIFT     (16U)
/*! H11 - Acquisition Filter Coefficient 11 */
#define XCVR_RX_DIG_ACQ_FILT_10_11_H11(x)        (((uint32_t)(((uint32_t)(x)) << XCVR_RX_DIG_ACQ_FILT_10_11_H11_SHIFT)) & XCVR_RX_DIG_ACQ_FILT_10_11_H11_MASK)
/*! @} */

/*! @name DEMOD_FILT_0_1 - Demod Filter Coeffs 0~1 */
/*! @{ */

#define XCVR_RX_DIG_DEMOD_FILT_0_1_H0_MASK       (0x1FFU)
#define XCVR_RX_DIG_DEMOD_FILT_0_1_H0_SHIFT      (0U)
/*! H0 - Demod Channel Filter Coefficient 0 */
#define XCVR_RX_DIG_DEMOD_FILT_0_1_H0(x)         (((uint32_t)(((uint32_t)(x)) << XCVR_RX_DIG_DEMOD_FILT_0_1_H0_SHIFT)) & XCVR_RX_DIG_DEMOD_FILT_0_1_H0_MASK)

#define XCVR_RX_DIG_DEMOD_FILT_0_1_H1_MASK       (0x1FF0000U)
#define XCVR_RX_DIG_DEMOD_FILT_0_1_H1_SHIFT      (16U)
/*! H1 - Demod Channel Filter Coefficient 1 */
#define XCVR_RX_DIG_DEMOD_FILT_0_1_H1(x)         (((uint32_t)(((uint32_t)(x)) << XCVR_RX_DIG_DEMOD_FILT_0_1_H1_SHIFT)) & XCVR_RX_DIG_DEMOD_FILT_0_1_H1_MASK)
/*! @} */

/*! @name DEMOD_FILT_2_4 - Demod Filter Coeffs 2~4 */
/*! @{ */

#define XCVR_RX_DIG_DEMOD_FILT_2_4_H2_MASK       (0x3FFU)
#define XCVR_RX_DIG_DEMOD_FILT_2_4_H2_SHIFT      (0U)
/*! H2 - Demod Channel Filter Coefficient 2 */
#define XCVR_RX_DIG_DEMOD_FILT_2_4_H2(x)         (((uint32_t)(((uint32_t)(x)) << XCVR_RX_DIG_DEMOD_FILT_2_4_H2_SHIFT)) & XCVR_RX_DIG_DEMOD_FILT_2_4_H2_MASK)

#define XCVR_RX_DIG_DEMOD_FILT_2_4_H3_MASK       (0xFFC00U)
#define XCVR_RX_DIG_DEMOD_FILT_2_4_H3_SHIFT      (10U)
/*! H3 - Demod Channel Filter Coefficient 3 */
#define XCVR_RX_DIG_DEMOD_FILT_2_4_H3(x)         (((uint32_t)(((uint32_t)(x)) << XCVR_RX_DIG_DEMOD_FILT_2_4_H3_SHIFT)) & XCVR_RX_DIG_DEMOD_FILT_2_4_H3_MASK)

#define XCVR_RX_DIG_DEMOD_FILT_2_4_H4_MASK       (0x3FF00000U)
#define XCVR_RX_DIG_DEMOD_FILT_2_4_H4_SHIFT      (20U)
/*! H4 - Demod Channel Filter Coefficient 4 */
#define XCVR_RX_DIG_DEMOD_FILT_2_4_H4(x)         (((uint32_t)(((uint32_t)(x)) << XCVR_RX_DIG_DEMOD_FILT_2_4_H4_SHIFT)) & XCVR_RX_DIG_DEMOD_FILT_2_4_H4_MASK)
/*! @} */

/*! @name ACQ_FILT_0_3_DRS - Acquisition Filter Coeffs 0~3 DRS */
/*! @{ */

#define XCVR_RX_DIG_ACQ_FILT_0_3_DRS_H0_MASK     (0x3FU)
#define XCVR_RX_DIG_ACQ_FILT_0_3_DRS_H0_SHIFT    (0U)
/*! H0 - Acquisition Filter Coefficient 0 */
#define XCVR_RX_DIG_ACQ_FILT_0_3_DRS_H0(x)       (((uint32_t)(((uint32_t)(x)) << XCVR_RX_DIG_ACQ_FILT_0_3_DRS_H0_SHIFT)) & XCVR_RX_DIG_ACQ_FILT_0_3_DRS_H0_MASK)

#define XCVR_RX_DIG_ACQ_FILT_0_3_DRS_H1_MASK     (0x3F00U)
#define XCVR_RX_DIG_ACQ_FILT_0_3_DRS_H1_SHIFT    (8U)
/*! H1 - Acquisition Filter Coefficient 1 */
#define XCVR_RX_DIG_ACQ_FILT_0_3_DRS_H1(x)       (((uint32_t)(((uint32_t)(x)) << XCVR_RX_DIG_ACQ_FILT_0_3_DRS_H1_SHIFT)) & XCVR_RX_DIG_ACQ_FILT_0_3_DRS_H1_MASK)

#define XCVR_RX_DIG_ACQ_FILT_0_3_DRS_H2_MASK     (0x7F0000U)
#define XCVR_RX_DIG_ACQ_FILT_0_3_DRS_H2_SHIFT    (16U)
/*! H2 - Acquisition Filter Coefficient 2 */
#define XCVR_RX_DIG_ACQ_FILT_0_3_DRS_H2(x)       (((uint32_t)(((uint32_t)(x)) << XCVR_RX_DIG_ACQ_FILT_0_3_DRS_H2_SHIFT)) & XCVR_RX_DIG_ACQ_FILT_0_3_DRS_H2_MASK)

#define XCVR_RX_DIG_ACQ_FILT_0_3_DRS_H3_MASK     (0x7F000000U)
#define XCVR_RX_DIG_ACQ_FILT_0_3_DRS_H3_SHIFT    (24U)
/*! H3 - Acquisition Filter Coefficient 3 */
#define XCVR_RX_DIG_ACQ_FILT_0_3_DRS_H3(x)       (((uint32_t)(((uint32_t)(x)) << XCVR_RX_DIG_ACQ_FILT_0_3_DRS_H3_SHIFT)) & XCVR_RX_DIG_ACQ_FILT_0_3_DRS_H3_MASK)
/*! @} */

/*! @name ACQ_FILT_4_7_DRS - Acquisition Filter Coeffs 4~7 DRS */
/*! @{ */

#define XCVR_RX_DIG_ACQ_FILT_4_7_DRS_H4_MASK     (0x7FU)
#define XCVR_RX_DIG_ACQ_FILT_4_7_DRS_H4_SHIFT    (0U)
/*! H4 - Acquisition Filter Coefficient 4 */
#define XCVR_RX_DIG_ACQ_FILT_4_7_DRS_H4(x)       (((uint32_t)(((uint32_t)(x)) << XCVR_RX_DIG_ACQ_FILT_4_7_DRS_H4_SHIFT)) & XCVR_RX_DIG_ACQ_FILT_4_7_DRS_H4_MASK)

